[
  {
    "headline": "It’s final: With EPS as the face, AIADMK, BJP form alliance for Tamil Nadu polls",
    "timestamp": 1744408766.732557
  },
  {
    "headline": "1 dead as strong dust storm hits Delhi-NCR; IMD issues red alert, flights diverted",
    "timestamp": 1744408766.732969
  },
  {
    "headline": "India, US finalise terms of reference for first phase of trade deal, Indian official says",
    "timestamp": 1744408766.732969
  },
  {
    "headline": "‘Withdraw Statement’: Priyanka Chaturvedi Objects To Kanhaiya Kumar's Tahawwur Rana Remarks",
    "timestamp": 1744408766.733981
  },
  {
    "headline": "Iran said to consider proposing interim nuclear deal in talks with US set for tomorrow",
    "timestamp": 1744408766.733981
  },
  {
    "headline": "Trump tariffs updates: China retaliates with 125% tariffs against U.S. imports",
    "timestamp": 1744408766.734531
  },
  {
    "headline": "PM Modi to inaugurate multiple projects of over ₹3,880 crore in Varanasi",
    "timestamp": 1744408766.734784
  },
  {
    "headline": "Hyderabad zoo park, Mir Alam Tank to be linked in Musi makeover",
    "timestamp": 1744408766.734784
  },
  {
    "headline": "BREAKING| Supreme Court Uploads Judgment In TN Governor Case, Directs Sending Of Judgment Copy To All",
    "timestamp": 1744408766.734784
  },
  {
    "headline": "Who was the pilot of the helicopter that crashed into Hudson River? Navy SEALS veteran, a former celebrit",
    "timestamp": 1744408766.734784
  },
  {
    "headline": "Judge rules Columbia University activist Mahmoud Khalil can be deported",
    "timestamp": 1744408948.468596
  },
  {
    "headline": "US envoy Witkoff holds talks with Putin about Ukraine as Trump tells Moscow to ‘get moving’",
    "timestamp": 1744408948.468596
  },
  {
    "headline": "Amid Trump tariffs, Jaishankar quips about the 'T' word: 'Landscape changed in a year'",
    "timestamp": 1744408948.468596
  },
  {
    "headline": "Gold price climbs to fresh record-high above $3,230 as US-China trade war deepens",
    "timestamp": 1744408948.468596
  },
  {
    "headline": "Why stock market rose today: Sensex ends 1,310 pts higher, Nifty above 22,800; 6 factors behind the rally",
    "timestamp": 1744408948.468596
  },
  {
    "headline": "OpenAI countersues Elon Musk, claims harassment",
    "timestamp": 1744408948.468596
  },
  {
    "headline": "Industrial output growth drops to six-month low at 2.9% in February",
    "timestamp": 1744408948.469595
  },
  {
    "headline": "Microsoft starts rolling out improved Recall feature for Windows Insiders",
    "timestamp": 1744408948.469595
  },
  {
    "headline": "OpenAI to replace GPT-4 with GPT-4o on ChatGPT from April 30",
    "timestamp": 1744408948.469595
  },
  {
    "headline": "iQOO Z10, Z10x launched in India: 7300mAh battery, Snapdragon chip, and everything you get",
    "timestamp": 1744408948.469595
  },
  {
    "headline": "TCS share price in focus after TCS Q4 results, wage hike delay announcement. Is it a stock to buy today?",
    "timestamp": 1744409179.720731
  },
  {
    "headline": "OnePlus Watch 3 price hike makes Galaxy Watch Ultra a better option",
    "timestamp": 1744409179.721731
  },
  {
    "headline": "Hema Malini and Esha Deol react to Sunny Deol’s 'Jaat' opening day box office collection: 'Dharam ji baho",
    "timestamp": 1744409179.721731
  },
  {
    "headline": "Celebrity Masterchef Winner: Gaurav Khanna lifts the trophy and takes home Rs 20 lakh prize money",
    "timestamp": 1744409179.721731
  },
  {
    "headline": "Grey's Anatomy actor Eric Dane, 52, diagnosed with ALS",
    "timestamp": 1744409179.721731
  },
  {
    "headline": "Raid 2 song ‘Nasha’: Tamannaah Bhatia invites drunk men to get high on her beauty, asks Riteish Deshmukh to eat her up with his eyes",
    "timestamp": 1744409179.721731
  },
  {
    "headline": "CSK vs KKR, IPL 2025 Highlights: Sunil Narine’s all round efforts help Kolkata Knight Riders demolish Chennai Super Kings by 8 wickets",
    "timestamp": 1744409179.721731
  },
  {
    "headline": "Mohun Bagan vs Bengaluru FC: India's best teams face up to unpredictable ISL Final",
    "timestamp": 1744409179.72273
  },
  {
    "headline": "IPL 2025: Match 27, SRH vs PBKS Match Prediction – Who will win today’s match between SRH vs PBKS?",
    "timestamp": 1744409179.72273
  },
  {
    "headline": "Freestyle Chess Tour Paris: India's challenge ends as Nakamura beats Erigaisi; Gukesh loses again",
    "timestamp": 1744409179.72273
  },
  {
    "headline": "Indian economy: Will trade-shy India gain edge in tariff-driven slowdown?",
    "timestamp": 1744409867.424241
  },
  {
    "headline": "BlackRock’s Larry Fink says U.S. is very close to a recession and may be in one now",
    "timestamp": 1744409872.176405
  },
  {
    "headline": "Gold price jumps Rs 6250 per 10 gm! Investors rolling in wealth! Did you invest?",
    "timestamp": 1744409872.176405
  },
  {
    "headline": "OnePlus Watch 3 Launches At $499, $170 More Than Promised; Are Trump Tariffs The Reason?",
    "timestamp": 1744409876.452303
  },
  {
    "headline": "‘Good Bad Ugly’ Day 1 box office: Ajith Kumar returns to form with Rs. 28.50 crore opening, bests ‘Vidaamuyarchi’ figure",
    "timestamp": 1744409885.888937
  },
  {
    "headline": "Iran says giving diplomacy ‘genuine chance’ in Oman talks with U.S",
    "timestamp": 1744409890.144419
  },
  {
    "headline": "Apple airlifts 1.5 million iPhones from India to US 'to beat' Trump tariffs: Report",
    "timestamp": 1744410111.084962
  },
  {
    "headline": "U.S. releases images of Tahawwur Hussain Rana being handed over to Indian authorities",
    "timestamp": 1744410111.085963
  },
  {
    "headline": "Industrial production drops to 6-month low of 2.9% in February",
    "timestamp": 1744410139.449337
  },
  {
    "headline": "The bond vigilantes won. The spike in yields helped drive the president to pause his trade war",
    "timestamp": 1744410139.449337
  },
  {
    "headline": "PSL 2025 Live Streaming: When, Where, and How to Watch Pakistan Super League Telecast on TV and Online?",
    "timestamp": 1744410196.690779
  },
  {
    "headline": "U.S. Defense Department terminates $5.1 billion in IT contracts with Accenture, Deloitte, others",
    "timestamp": 1744410250.462506
  },
  {
    "headline": "Why did the US stock market crash despite Trump tariff pause?",
    "timestamp": 1744410250.462506
  },
  {
    "headline": "European Union to put countermeasures to U.S. tariffs on hold for 90 days",
    "timestamp": 1744410250.463519
  },
  {
    "headline": "U.S. Social Security Declares Thousands of Latino Immigrants “Deceased” to Cut Off Their Benefits",
    "timestamp": 1744410250.463519
  },
  {
    "headline": "What is NASA’s strategy to spot and stop 'dangerous asteroids' from hitting Earth?",
    "timestamp": 1744410276.984885
  },
  {
    "headline": "India’s language war: Why is Hindi sparking a north-south divide?",
    "timestamp": 1744411196.849959
  },
  {
    "headline": "Gold Price Today: Yellow metal hits record high of ₹93,887 per 10 gram; How to place bullish bets on MCX?",
    "timestamp": 1744411223.881713
  },
  {
    "headline": "Dream Of Buying Your Favourite SUV In Trouble?",
    "timestamp": 1744411223.881713
  },
  {
    "headline": "\"Lost Too Many...\": MS Dhoni's 1st Reaction As CSK Captain Is Blunt Analysis Of Team In IPL 2025",
    "timestamp": 1744411272.580179
  },
  {
    "headline": "Should You Have Kids If You Know They’ll Be Sick?",
    "timestamp": 1744411377.220789
  },
  {
    "headline": "What does the sugar in beverages do to your body?",
    "timestamp": 1744411377.221883
  },
  {
    "headline": "Even a ‘chubby’ child can be malnourished. Here are 6 tips every parent needs to know to avoid health issues in children",
    "timestamp": 1744411377.222781
  },
  {
    "headline": "2025 Maruti WagonR Launch Price Rs 5.64 Lakh",
    "timestamp": 1744412283.833655
  },
  {
    "headline": "Spacious Mahindra XUV700 Rival Launching This Month!",
    "timestamp": 1744412283.833655
  },
  {
    "headline": "Gujarat Titans Drop Rs 3.2 Crore Star Despite Good Show. Coach Says 'We Had Enough...\"",
    "timestamp": 1744412331.717122
  },
  {
    "headline": "Jason Momoa Worldwide Box Office: On Track To Hit A Massive Career Total Milestone Owing To A Minecraft Movie!",
    "timestamp": 1744412354.886546
  }
]