[
  {
    "timestamp": "2025-04-12T02:59:30.912533",
    "headlines": [
      "US, China’s looming woes may deal a far bigger blow to India than Trump tariffs",
      "'We never negotiate at gunpoint': India after Donald Trump hits 90-day pause on tariffs",
      "Microsoft starts rolling out improved Recall feature for Windows Insiders",
      "Why stock market rose today: Sensex ends 1,310 pts higher, Nifty above 22,800; 6 factors behind the rally",
      "OpenAI to replace GPT-4 with GPT-4o from April 30",
      "India, US finalise terms of reference for first phase of trade deal, Indian official says",
      "Gold prices surge to new record high amid worries about impact of Trump tariffs on global economy",
      "It’s official: AIADMK, BJP to fight Tamil Nadu Assembly polls together",
      "Chennai Super Kings vs Kolkata Knight Riders Highlights, IPL 2025: MS Dhoni's CSK Captaincy Return Ends In Humiliating Loss vs KKR",
      "‘Glad the day has come’: Marco Rubio hails extradition of Tahawwur Rana to face charges"
    ]
  },
  {
    "timestamp": "2025-04-12T03:04:40.151620",
    "headlines": [
      "Passenger beaten by Railway catering staff after complaint on overpriced food",
      "PM Modi to inaugurate multiple projects of over ₹3,880 crore in Varanasi",
      "CSK vs KKR, IPL 2025 Highlights: Sunil Narine’s all round efforts help Kolkata Knight Riders demolish Chennai Super Kings by 8 wickets",
      "Trump tariffs updates: China retaliates with 125% tariffs against U.S. imports",
      "Gold price climbs to fresh record-high above $3,230 as US-China trade war deepens",
      "iQOO Z10, Z10x launched in India: 7300mAh battery, Snapdragon chip, and everything you get",
      "Iran said to consider proposing interim nuclear deal in talks with US set for tomorrow",
      "India natural economic partner, key to stability in Indo-Pacific region, says Italian Deputy PM Antonio Tajani",
      "OnePlus Watch 3 Launches At $499, $170 More Than Promised; Are Trump Tariffs The Reason?",
      "BlackRock’s Larry Fink says U.S. is very close to a recession and may be in one now"
    ]
  },
  {
    "timestamp": "2025-04-12T03:07:07.901071",
    "headlines": [
      "OpenAI countersues Elon Musk, claims harassment",
      "1 dead as strong dust storm hits Delhi-NCR; IMD issues red alert, flights diverted",
      "Samsung launches India’s first glasses-free 3D monitor, 4K 240Hz OLED gaming display",
      "KL Rahul’s 'My Ground' celebration sparks chatter in RCB camp as Tim David enacts fiery gesture during post-match chat",
      "'India-US could finalise partial bilateral trade deal amid 90-day tariff truce'",
      "Industrial output growth drops to six-month low at 2.9% in February",
      "Hyderabad zoo park, Mir Alam Tank to be linked in Musi makeover",
      "OpenAI to replace GPT-4 with GPT-4o on ChatGPT from April 30",
      "‘Withdraw Statement’: Priyanka Chaturvedi Objects To Kanhaiya Kumar's Tahawwur Rana Remarks",
      "Indian economy: Will trade-shy India gain edge in tariff-driven slowdown?"
    ]
  },
  {
    "timestamp": "2025-04-12T03:12:40.141669",
    "headlines": [
      "Fujifilm leak confirms optical viewfinder, affordable price, and minimal UI for new compact camera",
      "Mohun Bagan vs Bengaluru FC: India's best teams face up to unpredictable ISL Final",
      "TCS share price in focus after TCS Q4 results, wage hike delay announcement. Is it a stock to buy today?",
      "BREAKING| Supreme Court Uploads Judgment In TN Governor Case, Directs Sending Of Judgment Copy To All",
      "GPU-Z updated with support for GeForce RTX 5060 Ti and Radeon RX 9070 GRE",
      "US envoy Witkoff holds talks with Putin about Ukraine as Trump tells Moscow to ‘get moving’",
      "Industrial production drops to 6-month low of 2.9% in February",
      "US vice president JD Vance likely in India on Apr 21, to meet PM Modi with NSA Mike Waltz",
      "Who was the pilot of the helicopter that crashed into Hudson River? Navy SEALS veteran, a former celebrit",
      "North India mercury drop lowers temp by bit in state"
    ]
  },
  {
    "timestamp": "2025-04-12T03:19:14.369762",
    "headlines": [
      "Judge rules Columbia University activist Mahmoud Khalil can be deported",
      "Google to embrace Anthropic’s standard for connecting AI models to data",
      "Taking Stock: Nifty above 22,800, Sensex jumps 1,310 pts on Trump's tariff pause",
      "Captain Rajat Patidar Snubbed KL Rahul After DC Star Decimated RCB? IPL 2025 Video Goes Viral",
      "Ex-OpenAI staffers file amicus brief opposing the company’s for-profit transition",
      "It’s final: With EPS as the face, AIADMK, BJP form alliance for Tamil Nadu polls",
      "Xiaomi X Pro QLED TVs Launched in India with 4K, 120Hz, and Google TV",
      "EAM Jaishankar at 9th Global Technology Summit: India sees “urgency” in finalising US, UK, EU trade pacts",
      "Amid Trump tariffs, Jaishankar quips about the 'T' word: 'Landscape changed in a year'",
      "India pushing for trade deals with US, EU with high urgency: Jaishankar"
    ]
  }
]